package bd;

public class Tables {
	 static String[] columnNames = {"Артикул",
             "Тип товара",
             "Наименование",
             "Производитель",
             "Поставщик",
             "Количество"
   };
    
   static String[][] data = {
             {"0011", "Цветы", "Белые розы", "ROSES&CO TM", "ФЛП Иванов Ю.А.", "6737"},
             {"0121", "Цветы", "Красные розы", "ROSES&CO TM", "ФЛП Иванов Ю.А.", "7254"},
             {"0131", "Цветы", "Розовые розы", "ROSES&CO TM", "ФЛП Иванов Ю.А.", "857"},
             {"0141", "Цветы", "Желтые розы", "ROSES&CO TM", "ФЛП Иванов Ю.А.", "930"},
             {"7321", "Цветы", "Синие розы", "New world TM", "ООО, Flowers", "120"},
             {"7320", "Цветы", "Черные розы", "ROSES&CO TM", "ООО, Flowers", "0"},
             {"7319", "Цветы", "Радужные розы", "ROSES&CO TM", "ООО, Flowers", "0"},
             {"6312", "Домашние цветы", "Герань", "Ethernity TM", "ООО, SmartS", "55"},
             {"6311", "Домашние цветы", "Рождественский цветок", "Ethernity TM", "ООО, SmartS", "55"},
   };
   static String[][] dataEmp = {
           {"", "", "", "", "", ""},
 };
   
   static String[] code = {"Артикул"};
   static String[] dataSmp = {""};

   static String[] columnNames2 = {"Номер", "Наименование",
             "Производитель",
             "Количество"
   };
   static String[][] dataEmp2 = {
           {"", "", "", ""},
 };
    
   static String[][] data2 = {
             {"Радужные розы", "ООО, Flowers", "101"},
   };
   ////////////////////////////////////////////////////////////////////
   static String[] columnNamesEmp = {"Номер", 
		   "ФИО",
           "Должность",
           "Отдел",
           "Пасспорт",
 };
 static String[][] dataForEmp = {
         {"", "", "", "", ""},
};
 
 ///////////////////////////////////////////////////////////////////////////
 static String[] columnNamesProv = {"Номер", 
		 "Наименование",
		 "Тип товара",
         "Адрес",
         "Телефон",
         
};
static String[][] dataForProv = {
       {"", "", "", "", ""},
};
///////////////////////////////////////////////////////////////////////////
static String[] columnNamesBuy = {"Номер", 
		 "Наименование",
        "Адрес",
        "Телефон",
        
};
static String[][] dataForBuy = {
      {"", "", "", ""},
};
///////////////////////////////////////////////////////////////////////////
static String[] columnNamesDep = {"Номер", 
		 "Наименование",
        "Телефон",
        
};
static String[][] dataForDep = {
      {"", "", ""},
};
}
